id: 8a1d8c12-8d0c-4e44-97d1-7b1320870d8d
name: NSG flow logs disabled or deleted
kind: Scheduled
description: |
  'Detects when NSG flow logs are disabled or deleted. Disabling flow logs reduces network visibility and can be used to evade detection of suspicious outbound traffic and lateral movement.'
severity: High
status: Available
requiredDataConnectors:
  - connectorId: AzureActivity
    dataTypes:
      - AzureActivity
queryFrequency: 15m
queryPeriod: 15m
triggerOperator: gt
triggerThreshold: 0
tactics:
  - DefenseEvasion
relevantTechniques:
  - T1562
query: |
  let queryFrequency = 15m;
  let FlowLogsChanges = AzureActivity
  | where ingestion_time() > ago(queryFrequency)
  | where ActivityStatusValue =~ "Success"
  | where tolower(OperationNameValue) has "microsoft.network/networkwatchers" and (tolower(OperationNameValue) endswith "/flowlogs/write" or tolower(OperationNameValue) endswith "/flowlogs/delete")
  | extend requestBody = tostring(parse_json(Properties).requestbody)
  | extend request = parse_json(requestBody)
  | extend props = coalesce(request.properties, request.Properties)
  | extend Enabled = tobool(props.enabled)
  | extend IsDelete = tolower(OperationNameValue) endswith "/flowlogs/delete"
  | extend IsDisabled = (tolower(OperationNameValue) endswith "/flowlogs/write") and (Enabled == false)
  | where IsDelete or IsDisabled
  | extend Name = tostring(split(Caller,'@',0)[0]), UPNSuffix = tostring(split(Caller,'@',1)[0]);
  FlowLogsChanges
  | project
      TimeGenerated,
      Caller,
      Name,
      UPNSuffix,
      CallerIpAddress,
      OperationNameValue,
      ResourceGroup,
      _ResourceId,
      Resource,
      CorrelationId,
      IsDelete,
      IsDisabled,
      Enabled
entityMappings:
  - entityType: AzureResource
    fieldMappings:
      - identifier: ResourceId
        columnName: _ResourceId
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: Caller
      - identifier: Name
        columnName: Name
      - identifier: UPNSuffix
        columnName: UPNSuffix
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: CallerIpAddress
customDetails:
  FlowLogResourceId: _ResourceId
  FlowLogName: Resource
  WasDeleted: IsDelete
  WasDisabled: IsDisabled
alertDetailsOverride:
  alertDisplayNameFormat: |
    NSG flow logs disabled or deleted
  alertDescriptionFormat: |
    NSG flow logs were disabled or deleted, reducing network visibility.

    Actor: {{Caller}}
    Source IP: {{CallerIpAddress}}
    Flow Log Resource: {{FlowLogResourceId}}
    Flow Log Name: {{FlowLogName}}
    Deleted: {{WasDeleted}}
    Disabled: {{WasDisabled}}
version: 1.0.0
